app/controllers/category_controller.rb

    def index
        category = Category.all
        if category.present?
---
SELECT "categories".* FROM "categories"

    def show
        category = Category.find_by(id: params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      def destroy
        if @category
          @category.destroy!
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 4]]

      def create
        category = Category.new(params.require(:category).permit(:name, :description))
        if category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "celana"], ["description", "celana boxer"], ["created_at", "2018-11-16 08:14:14.060065"], ["updated_at", "2018-11-16 08:14:14.060065"]]

      def find_category
        @category = Category.find_by(id: params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]