app/controllers/productcategory_controller.rb

SELECT "product_categories".* FROM "product_categories"
---
	def index
	  @prodcat = ProductCategory.all