app/controllers/product_controller.rb

SELECT "products".* FROM "products"
---
    def index
        product = Product.all
        if product.present?